Revit 2027 API
BuiltInFailures.SketchFailures.MoreThanOneAxis Property
 More than one axes of revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MoreThanOneAxis { get; }
Public Shared ReadOnly Property MoreThanOneAxis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MoreThanOneAxis {
	FailureDefinitionId^ get ();
}
static member MoreThanOneAxis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace